Terraform Plan:
```[command]/home/runner/work/_temp/b00fb7df-4326-44e7-b05b-38945efd0788/terraform-bin show /tmp/tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # random_string.random[0m will be created
[0m  [32m+[0m[0m resource "random_string" "random" {
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m length           = 16
      [32m+[0m[0m lower            = true
      [32m+[0m[0m min_lower        = 0
      [32m+[0m[0m min_numeric      = 0
      [32m+[0m[0m min_special      = 0
      [32m+[0m[0m min_upper        = 0
      [32m+[0m[0m number           = true
      [32m+[0m[0m numeric          = true
      [32m+[0m[0m override_special = "/@£$"
      [32m+[0m[0m result           = (known after apply)
      [32m+[0m[0m special          = true
      [32m+[0m[0m upper            = true
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m string_out = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # random_string.random[0m will be created%0A[0m  [32m+[0m[0m resource "random_string" "random" {%0A      [32m+[0m[0m id               = (known after apply)%0A      [32m+[0m[0m length           = 16%0A      [32m+[0m[0m lower            = true%0A      [32m+[0m[0m min_lower        = 0%0A      [32m+[0m[0m min_numeric      = 0%0A      [32m+[0m[0m min_special      = 0%0A      [32m+[0m[0m min_upper        = 0%0A      [32m+[0m[0m number           = true%0A      [32m+[0m[0m numeric          = true%0A      [32m+[0m[0m override_special = "/@£$"%0A      [32m+[0m[0m result           = (known after apply)%0A      [32m+[0m[0m special          = true%0A      [32m+[0m[0m upper            = true%0A    }%0A%0A[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.%0A[0m%0AChanges to Outputs:%0A  [32m+[0m[0m string_out = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0
```
